id: os_device_name_change_disable
title: "Disable Device Name Change"
discussion: |
  Device name change _MUST_ be disabled.   
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93475-2
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowDeviceNameModification: false
