id: os_exchange_SMIME_signing_enabled
title: "Enable S/MIME Signing"
discussion: |
  S/MIME signing _MUST_ be enabled and set as the default.

  S/MIME signing verifies the sender of an email and ensures that email contents are not altered.
check: ""
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93482-8
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)   
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed: 
    SMIMESigningEnabled: true
