id: os_exchange_SMIME_encryption_enforce
title: "Enforce S/MIME Encryption"
discussion: |
  S/MIME encryption _MUST_ be enforced. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93479-4
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail) 
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  com.apple.eas.account: 
    SMIMEEncryptByDefault: true
