id: os_exchange_mail_recents_sync_disable
title: "Disable Recent Addresses Syncing"
discussion: |
  Recent addresses syncing _MUST_ be disabled.

  Disabling recent address syncing prevents sensitive addresses from being synced locally to the device.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93484-4
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail) 
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed:
    disableMailRecentsSyncing: true
