id: os_exchange_per_app_VPN_enforce
title: "Enforce Per-App VPN for Managed Mail Accounts"
discussion: |
  Per-app VPN _MUST_ be configured for managed mail accounts.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93485-1
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail) 
iOS:
  - "17.0"
odv:
  hint: "Use UUID to leverage the specific VPNUUID"
  recommended: VPNUUID
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed: 
    VPNUUID: $ODV
