id: os_exchange_prevent_move_enforce
title: "Prevent move manged mails to another account."
discussion: |
  The prevent mail move setting _MUST_ be enabled.
  
  If this rule is not enforced then the system will allow moving messages out of the users email account and into another account. Enabling this setting also prevents forwarding or replying from an account other than the recipient of the message.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93486-9
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)  
iOS:
  - "17.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed: 
    PreventMove: true
