id: os_exchange_SMIME_signing_certificate_overwrite_disable
title: "Disable S/MIME Signing Certificate Overwrite"
discussion: |
  The S/MIME signing certificate overwrite option _MUST_ be disabled.

  Disabling the option to change the S/MIME signing certificate forces users to use the organization-defined signature. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93481-0
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)  
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed: 
    SMIMESigningCertificateUUIDUserOverrideable: false
