id: os_exchange_SMIME_encryption_per_message_disable
title: "Disable Per-Message Encryption Switch"
discussion: |
  Encryption per-message switch _MUST_ be disabled. 

  If per-message encryption switching is enabled, the user can turn off encryption before sending a message. 
check: " "
fix: This is implemented by a Configuration Profile
references:
  cce:
    - CCE-93480-2
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.6.1 - Mail)  
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed: 
    SMIMEEnableEncryptionPerMessageSwitch: false
