id: os_force_wifi_connections_enable
title: "Force WiFi Connections to Known Networks"
discussion: |
  The setting to force WiFi connections to known networks _MUST_ be enabled.

  Only allowing known networks can help prevent unauthorized access to an organization's devices and data.
check: " "
result:
  string: "true"
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93490-1
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 5.7 - Interfaces)
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceWiFiToAllowedNetworksOnly: true
