id: os_screen_observation_remote_disable
title: "Disable Remote Screen Observation"
discussion: |
  Remote screen observation _MUST_ be disabled.

  Disabling remote screen observation helps to prevent data leaks.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93496-8
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowRemoteScreenObservation: false
    
