id: os_screen_observation_unprompted_disable
title: "Disable Unprompted Screen Observation"
discussion: |
  Automatic acceptance for unprompted screen observations _MUST_ be disabled.

  Disabling automatic acceptance for unprompted screen observations helps to prevent against data leaks.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93497-6
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceClassroomUnpromptedScreenObservation: false
    
