id: os_safari_JavaScript_disable
title: "Disable Java Script"
discussion: |
  Java Script _MUST_ be disabled in Safari.

  Disabling Java Script in Safari reduces the risk of malicious code being executed on the device.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93494-3
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowJavaScript: false
