id: os_safari_popups_disable
title: "Disable Safari Popups"
discussion: |
  Safari popups _MUST_ be disabled.

  Disabling popups on Safari helps minimize the device's exposure to viruses, malware, and other risks.
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93495-0
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    safariAllowPopups: false
