id: os_update_OTAPKI_allow
title: "Allow OTA PKI Updates"
discussion: |
  Over-the-air (OTA) Public Key Infrastructure (PKI) updates _MUST_ be allowed. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93506-4
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.0"
tags:
  - ios
  - indigo_high
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOTAPKIUpdates: true
