id: os_update_enforced_software_update_delay
title: "Enforce Software Update Delay"
discussion: |
  A software update delay of $ODV days _MUST_ be enforced. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93508-0
  800-53r5:
    - N/A
  indigo:
    - ANNEX D (Section 6.3.1.2 - Update management)
iOS:
  - "17.0"
odv:
  hint: "Enforced a software update delay in days"
  recommended: 30
  indigo_base: 30
  indigo_high: 30
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceDelayedSoftwareUpdates: true
    enforcedSoftwareUpdateDelay: $ODV
