id: os_unpaired_boot_disable
title: "Disable Recovery via Unpaired Devices"
discussion: |
  Device recovery via unpaired device boot _MUST_ be disabled. 
check: " "
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-93505-6
  800-53r5:
    - N/A
  indigo:
    - ANNEX K
iOS:
  - "17.4.1"
tags:
  - ios
  - indigo_base
  - indigo_high
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowUnpairedExternalBootToRecovery: false
