id: system_settings_software_update_download_enforce
title: Enforce Software Update Downloads Updates Automatically
discussion: |
  Software Update _MUST_ be configured to enforce automatic downloads of updates is enabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SoftwareUpdate')\
  .objectForKey('AutomaticDownload').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-95403-2
  cci:
    - N/A
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r3:
    - N/A
  cis:
    benchmark:
      - 1.2 (level 1)
    controls v8:
      - 7.3
      - 7.4
  bio:
    - 8.08.01
macOS:
  - '26.0'
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - nlmapgov_base
  - nlmapgov_plus
mobileconfig: true
mobileconfig_info:
  com.apple.SoftwareUpdate:
    AutomaticDownload: true
